In [2]:
import pandas as pd
import seaborn as sns

#### 라이브러리 예제

In [5]:
df = sns.load_dataset("mpg")
df.head(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite

In [6]:
# origin으로 그룹을 잡아서 size 알아보기

df.groupby(by="origin").size()

origin
europe     70
japan      79
usa       249
dtype: int64

In [7]:
# 위랑 같은 결과는 앞에서 배웠던 value_counts()
df['origin'].value_counts()

usa       249
japan      79
europe     70
Name: origin, dtype: int64

In [8]:
# origin 별로 평균값을 보고 싶다면?

df.groupby(by="origin").mean()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
origin,,,,,,,
europe,27.891429,4.157143,109.142857,80.558824,2423.300000,16.787143,75.814286
japan,30.450633,4.101266,102.708861,79.835443,2221.227848,16.172152,77.443038
usa,20.083534,6.248996,245.901606,119.048980,3361.931727,15.033735,75.610442

In [9]:
# cylinders 값만 보고 싶다면? 

df.groupby(by="origin")['cylinders'].mean()

origin
europe    4.157143
japan     4.101266
usa       6.248996
Name: cylinders, dtype: float64

In [10]:
# 중간값 보기
df.groupby(by="origin")['cylinders'].median()

origin
europe    4
japan     4
usa       6
Name: cylinders, dtype: int64

In [12]:
# 그룹을 열러개 설정

df.groupby(['model_year','origin'])['cylinders'].mean()

model_year  origin
70          europe    4.000000
            japan     4.000000
            usa       7.636364
71          europe    4.000000
            japan     4.000000
            usa       6.200000
72          europe    4.000000
            japan     3.800000
            usa       6.888889
73          europe    4.000000
            japan     4.250000
            usa       7.241379
74          europe    4.000000
            japan     4.000000
            usa       6.266667
75          europe    4.000000
            japan     4.000000
            usa       6.400000
76          europe    4.250000
            japan     4.500000
            usa       6.363636
77          europe    4.000000
            japan     4.166667
            usa       6.222222
78          europe    4.833333
            japan     4.000000
            usa       6.000000
79          europe    4.250000
            japan     4.000000
            usa       6.260870
80          europe    4.111111
            japan     4.076923
            usa       4.285714
81          europe    4.500000
            japan     4.333333
            usa       4.923077
82          europe    4.000000
            japan     4.000000
            usa       4.300000
Name: cylinders, dtype: float64

### pivot_table

In [11]:
# group_by와 유사

df.pivot_table?

In [11]:
student_list = {
    "name": [
        "John", "Nate", "Abraham", "Brian", "Janny", "Yuna", "Jeniffer",
        "Edward", "Zara", "Wendy", "Sera"
    ],
    "major": [
        "Computer Science", "Computer Science", "Physics", "Psychology",
        "Economics", "Economics", "Computer Science", "Computer Science",
        "Psychology", "Economics", "Psychology"
    ],
    "gender": [
        "male", "male", "male", "male", "female", "female", "female", "male",
        "female", "female", "female"
    ]
}
df = pd.DataFrame(student_list)
df

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [12]:
# 학과별로 몇 명이 있는지 알고 싶다면?

groupby_major = df.groupby('major')
groupby_major.groups

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

In [14]:
for name, group in groupby_major:
    print(name + " : " + str(len(group)))
    print(group)

Computer Science : 4
       name             major  gender
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male
Economics : 3
    name      major  gender
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female
Physics : 1
      name    major gender
2  Abraham  Physics   male
Psychology : 3
     name       major  gender
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [15]:
# 학과별로 데이터프레임 생성하고 싶다면?

df_major_cnt = pd.DataFrame({'count': groupby_major.size()})
df_major_cnt

                  count
major
Computer Science      4
Economics             3
Physics               1
Psychology            3

In [16]:
# major 을 column 으로 설정

df_major_cnt.reset_index()

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [17]:
# 성별로 그룹화 하기

groupby_gender = df.groupby('gender')
groupby_gender.groups

{'female': Int64Index([4, 5, 6, 8, 9, 10], dtype='int64'),
 'male': Int64Index([0, 1, 2, 3, 7], dtype='int64')}

In [18]:
for name, group in groupby_gender:
    print(name+" : "+str(len(group)))
    print(group)

female : 6
        name             major  gender
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
male : 5
      name             major gender
0     John  Computer Science   male
1     Nate  Computer Science   male
2  Abraham           Physics   male
3    Brian        Psychology   male
7   Edward  Computer Science   male